Tekla Open API Reference for Tekla Structures 2025
LinkAttributes.Frame Property
 Gets or sets the link frame attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LinkFrameAttributes Frame { get; set; }
Public Property Frame As LinkFrameAttributes
	Get
	Set
Property Value
Type: LinkFrameAttributes
See Also
Reference
LinkAttributes Class
Tekla.Structures.Drawing Namespace